## Plan Result (stg_landing - TerraformPlanApply)




<pre><code>Plan: 15 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_monitor_diagnostic_setting.shared_integration_datafactory
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta002-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]
* Update
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-stg&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_monitor_diagnostic_setting.shared_integration_datafactory will be created
  + resource "azurerm_monitor_diagnostic_setting" "shared_integration_datafactory" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-stg"
      + name                           = "shared-integration-datafactory-diag"
      + target_resource_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["landing"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1d560979-d70e-41a1-b2dc-3b457e911249"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-stg"
        name                                                   = "ingest00-legacy-sql-stg"
        tags                                                   = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (42 unchanged attributes hidden)

      + identity {
          + type = "SystemAssigned"
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this["ingest00-integration-databricks001-stg"] will be updated in-place
  ~ resource "azurerm_data_factory_linked_service_azure_databricks" "this" {
        id                         = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg/linkedservices/ingest00-integration-databricks001-stg"
        name                       = "ingest00-integration-databricks001-stg"
        # (8 unchanged attributes hidden)

      ~ new_cluster_config {
          ~ custom_tags                 = {
              + "autoShutdown"        = "true"
                # (7 unchanged elements hidden)
            }
            # (9 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest00-meta002-stg"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"
      + name                     = "ingest00-meta002-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["keyvault"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-keyvault-stg"
      + subresource_name   = "vault"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-landing-blob-stg"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-dfs"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-landing-dfs-stg"
      + subresource_name   = "dfs"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["keyvault"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["landing-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["landing-dfs"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["mssql"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-curated"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-raw"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = "vm-ingest00-legacy-sql-stg-dcra"
      + target_resource_id      = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-stg"
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "staging"
          + "startupMode"         = "always"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-stg"
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] will be created
  + resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AntiMalwareEndpointProtection"
      + publisher                   = "Microsoft.Azure.Security"
      + settings                    = <<-EOT
            {
                  "AntimalwareEnabled": "true",
                  "RealtimeProtectionEnabled": "true",
                  "ScheduledScanSettings": {"day":"7","isEnabled":"true","scanType":"Quick","time":"120"}
                }
        EOT
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "staging"
          + "startupMode"         = "always"
        }
      + type                        = "IaaSAntimalware"
      + type_handler_version        = "1.6"
      + virtual_machine_id          = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-stg"
    }

Plan: 15 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"stg_landing - TerraformPlanApply","Vars":{}} -->